Trainingparameter:
ValidationSplit: 0.2
Batchsize: 5
Epochs: 30
Patience for Early Stopping: 20
Inputdimension: ((40, 1))

Results:
Trainingaccuracy: 94.98109345831138
Testaccuracy: 81.81818181818183

Modelarchitecture:
Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_12 (LSTM)               (None, 40, 300)           362400    
_________________________________________________________________
dropout_9 (Dropout)          (None, 40, 300)           0         
_________________________________________________________________
lstm_13 (LSTM)               (None, 300)               721200    
_________________________________________________________________
dropout_10 (Dropout)         (None, 300)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 10)                3010      
=================================================================
Total params: 1,086,610
Trainable params: 1,086,610
Non-trainable params: 0
_________________________________________________________________
