Trainingparameter:
ValidationSplit: 0.2
Batchsize: 5
Epochs: 250
Patience for Early Stopping: 30
Inputdimension: ((40, 1))

Results:
Trainingaccuracy: 96.29629651705423
Testaccuracy: 51.515151515151516

Modelarchitecture:
Model: "sequential_27"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_14 (Conv1D)           (None, 34, 2)             16        
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 34, 2)             0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 34, 2)             8         
_________________________________________________________________
flatten_12 (Flatten)         (None, 68)                0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 68)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 128)               8832      
_________________________________________________________________
dense_59 (Dense)             (None, 10)                1290      
=================================================================
Total params: 10,146
Trainable params: 10,142
Non-trainable params: 4
_________________________________________________________________
