Trainingparameter:
ValidationSplit: 0.2
Batchsize: 20
Epochs: 250
Patience for Early Stopping: 20
Inputdimension: ((50, 1))

Results:
Trainingaccuracy: 73.28979040224883
Testaccuracy: 75.75757575757575

Modelarchitecture:
Model: "sequential_40"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_63 (Conv1D)           (None, 46, 1)             6         
_________________________________________________________________
leaky_re_lu_63 (LeakyReLU)   (None, 46, 1)             0         
_________________________________________________________________
batch_normalization_63 (Batc (None, 46, 1)             4         
_________________________________________________________________
conv1d_64 (Conv1D)           (None, 42, 1)             6         
_________________________________________________________________
leaky_re_lu_64 (LeakyReLU)   (None, 42, 1)             0         
_________________________________________________________________
batch_normalization_64 (Batc (None, 42, 1)             4         
_________________________________________________________________
flatten_32 (Flatten)         (None, 42)                0         
_________________________________________________________________
dropout_42 (Dropout)         (None, 42)                0         
_________________________________________________________________
dense_68 (Dense)             (None, 256)               11008     
_________________________________________________________________
dense_69 (Dense)             (None, 10)                2570      
=================================================================
Total params: 13,598
Trainable params: 13,594
Non-trainable params: 4
_________________________________________________________________
